# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with optimized CBAM attention mechanism
# Optimized CBAM placement for crack detection

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-cbam-optimized.yaml' will call yolo11-cbam-optimized.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 289 layers, 2456720 parameters, 2456704 gradients, 6.2 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 289 layers, 9123392 parameters, 9123376 gradients, 20.8 GFLOPs
  m: [0.50, 1.00, 512] # summary: 349 layers, 19611648 parameters, 19611632 gradients, 66.8 GFLOPs
  l: [1.00, 1.00, 512] # summary: 541 layers, 24869120 parameters, 24869104 gradients, 85.9 GFLOPs
  x: [1.00, 1.50, 512] # summary: 541 layers, 56463136 parameters, 56463120 gradients, 194.3 GFLOPs

# YOLO11n backbone with optimized CBAM attention
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, CBAM, [7]] # 5-CBAM只在P3层添加 (对中层特征增强)
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, CBAM, [7]] # 10-CBAM只在P5层添加 (对高层特征增强)
  - [-1, 1, SPPF, [1024, 5]] # 11
  - [-1, 2, C2PSA, [1024]] # 12

# YOLO11n head with optimized CBAM enhanced features
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P4 (adjusted index due to reduced CBAM layers)
  - [-1, 2, C3k2, [512, False]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3 with CBAM (adjusted index)
  - [-1, 2, C3k2, [256, False]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5 with CBAM
  - [-1, 2, C3k2, [1024, True]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5) 